cfd/openfoam/meshing/AMR/01_shockWave/constant/refineInterval1e20
refineInterval 10000;
