cfd/openfoam/meshing/AMR/01_shockWave/system/include/materialPoint
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Material point coordinates
materialPnt_x 15.0000001;
materialPnt_y 15.0000001;
materialPnt_z 15.0000001;
